Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Smallrye Reactive Messaging enables implementing custom commit strategies. See https://smallrye.io/smallrye-reactive-messaging/latest/kafka/receiving-kafka-records/#acknowledgement[SmallRye Reactive Messaging documentation] for more information.
ja_jp: Smallrye Reactive Messaging を使用すると、カスタム コミット戦略を実装できます。 詳細については、 https://smallrye.io/smallrye-reactive-messaging/latest/kafka/recoming-kafka-records/#acknowledgement[SmallRye Reactive Messaging のドキュメント] を参照してください。

source: Smallrye Reactive Messaging enables implementing custom failure strategies. See https://smallrye.io/smallrye-reactive-messaging/latest/kafka/receiving-kafka-records/#acknowledgement[SmallRye Reactive Messaging documentation] for more information.
ja_jp: Smallrye Reactive Messaging を使用すると、カスタム 失敗戦略を実装できます。 詳細については、 https://smallrye.io/smallrye-reactive-messaging/latest/kafka/recoming-kafka-records/#acknowledgement[SmallRye Reactive Messaging のドキュメント] を参照してください。

source: Smartphone detected in WiFi domain model:
ja_jp: WiFi ドメインモデルで検出されたスマートフォン:

source: SnapStart considerations
ja_jp: SnapStartの考慮事項

source: SnapStart uses the CRaC API to allow the application to execute custom code before the snapshotting or during the restoration.
ja_jp: SnapStartはCRaC APIを使用して、スナップショット前またはリストア中にアプリケーションでカスタムコードを実行できるようにします。

source: Snapshot testing
ja_jp: スナップショットテスト

source: Snapshot testing is a way to make sure the content generated by a test doesn't change from one revision to another, i.e. between commits. That means, the generated content for each commit needs to be immutable and deterministic (this is the reason for using mocked data). To be able to perform such checks, we auto-generate snapshots of the generated content and commit them as the references of the expected output for subsequent test runs. When the templates change, we also commit the induced snapshots changes. This way, during the review, we can make sure the applied code changes have the expected effects on the generated output.
ja_jp: スナップショット テストとは、テストによって生成されるコンテンツが、あるリビジョンから別のリビジョン、つまりコミット間で変更されないようにする方法です。つまり、コミットごとに生成されるコンテンツは、不変であり、決定性がある必要があります（これが、モックされたデータを使用する理由です）。このようなチェックを行うために、生成されたコンテンツのスナップショットを自動生成し、後続のテスト実行時に期待される出力の参照先としてコミットします。テンプレートが変更された場合は、生成されたスナップショットの変更もコミットします。このようにして、レビューの際には、適用されたコードの変更が、生成された出力に対して期待される効果を持つことを確認することができます。

source: Snippets from this source file are then included using the following path:
ja_jp: そして、このソースファイルからのスニペットは、以下のパスを使ってインクルードされます:

source: Snippets from this source file are then referenced with the following path:
ja_jp: そして、このソースファイルからのスニペットは、次のようなパスで参照されます:

source: So as you can see, the status is `DOWN` as soon as one of the `quarkus.kafka-streams.topics` is missing or the Kafka Streams `state` is not `RUNNING`.
ja_jp: つまり、 `quarkus.kafka-streams.topics` のいずれかが欠落しているか、Kafka Streamsの `state`が `RUNNING`でなければ、すぐにステータスが `DOWN` になります。

source: So could we somehow keep the library standard but have Quarkus adjust the bytecode when building the application?
ja_jp: そこで、ライブラリは標準のまま、アプリケーションのビルド時にQuarkusでバイトコードを調整することはできないでしょうか。

source: So far in all our examples we only start Quarkus once for all tests. Before the first test is run Quarkus will boot, then all tests will run, then Quarkus will shut down at the end. This makes for a very fast testing experience however it is a bit limited as you can't test different configurations.
ja_jp: これまでの例では、すべてのテストで Quarkus を 1 回だけ起動しました。最初のテストが実行される前に Quarkus が起動し、その後すべてのテストが実行され、最後に Quarkus がシャットダウンされます。これにより、非常に高速なテストが可能になりますが、様々な設定をテストすることができないため、少し制限されます。

source: So far in all our examples we only start Quarkus once for all tests. Before the first test is run Quarkus will boot, then all tests will run, then Quarkus will shutdown at the end. This makes for a very fast testing experience however it is a bit limited as you can't test different configurations.
ja_jp: これまでのところ、すべての例では、すべてのテストに対して一度だけQuarkusを起動しています。最初のテストが実行される前にQuarkusが起動し、次にすべてのテストが実行され、最後にQuarkusがシャットダウンします。これにより、非常に高速なテストが可能になりますが、異なる設定をテストすることができないため、少し制限があります。

source: So far so good, now let's try with an allowed user.
ja_jp: ここまでは順調ですが、今度は許可されたユーザーで試してみましょう。

source: So far we have only covered integration style tests that test the app via HTTP endpoints, but what if we want to do unit testing and test our beans directly?
ja_jp: これまでは、HTTP エンドポイントを介してアプリをテストする統合スタイルのテストしか取り上げてきませんでしたが、 ユニットテストを行い、Beanを直接テストしたい場合はどうでしょうか?

source: So far we have only tested the Quarkus endpoint using OIDC authorization code flow. In this flow you use the browser to access the Quarkus endpoint, Quarkus itself manages the authorization code flow, a user is redirected to Auth0, logs in, is redirected back to Quarkus, Quarkus completes the flow by exchanging the code for the ID, access, and refresh tokens, and works with the ID token representing the successful user authentication. The access token is not relevant at the moment. As mentioned earlier, in the authorization code flow, Quarkus will only use the access token to access downstream services on behalf of the currently authenticated user.
ja_jp: これまで、OIDC 認可コードフローを使用して Quarkus エンドポイントのみをテストしてきました。このフローでは、ブラウザーを使用して Quarkus エンドポイントにアクセスし、Quarkus 自体が認可コードフローを管理します。ユーザーは Auth0 にリダイレクトされてログインし、Quarkus に再度リダイレクトされます。その後 Quarkus が ID トークン、アクセストークン、およびリフレッシュトークンのコードを交換してフローを完了し、ユーザー認証の成功を表す ID トークンを処理します。この時点でアクセストークンは使用されません。前述のとおり、Quarkus が認可コードフローでアクセストークンを使用するのは、認証済の現行ユーザーに代わってダウンストリームサービスにアクセスする場合に限られます。

source: So far we only handle the item events, but handling failure is essential. You can handle failures using `onFailure()`.
ja_jp: これまではアイテムのイベントだけを処理してきましたが、失敗の処理は必須です。 `onFailure()` を使って失敗を処理することができます。

source: So far, our API has only allowed us to query directly for an entity or list of entities. Now we want to allow clients to search all of our entities. While `Hero` and `Ally` have a shared abstract type of `Character`, there is no abstraction that also includes `Film`.
ja_jp: これまで、私たちのAPIでは、エンティティやエンティティのリストに対して直接クエリを発行することだけが可能でした。今度は、クライアントが当社のすべてのエンティティを検索できるようにしたいと思います。 `Hero` と `Ally` は共有の抽象型である `Character` を持っていますが、 `Film` も含む抽象型はありません。

source: So far, we didn't use Stork; we just deployed the services we will be discovering, selecting, and calling.
ja_jp: ここまでのところ Storkは使用していません。これから検出、選択、呼び出しを行うサービスをデプロイしました。

source: So far, we didn't use Stork; we just scaffolded the services we will be discovering, selecting, and calling.
ja_jp: ここまでは、Storkを使わずに、これから発見するサービス、選択するサービス、呼び出すサービスの骨組を構築してきました。

source: So far, we have used the Vert.x Core API. Vert.x offers much more. It provides a vast ecosystem. In this section, we will see how you can use the Vert.x Web Client, a reactive HTTP client.
ja_jp: ここまでは、Vert.x Core APIを使用してきました。 Vert.xはそれ以上のものを提供しています。 Vert.xは広大なエコシステムを提供します。 このセクションでは、リアクティブHTTPクライアントであるVert.x Web Clientの使用方法について説明します。

source: So given these bridge methods are problematic, one solution would be to get rid of them.
ja_jp: ですから、これらのブリッジ方式が問題であることを考えると、これを廃止することが一つの解決策になると思います。

source: So if `Basic` and `Authorization Code` mechanisms are combined then `401` will be returned if no credentials are provided and if `JWT` and `Authorization Code` mechanisms are combined then a redirect URL will be returned.
ja_jp: つまり、 `Basic` と `Authorization Code` の仕組みが組み合わされた場合、認証情報が提供されなければ `401` が返され、 `JWT` と `Authorization Code` の仕組みが組み合わされた場合、リダイレクト URL が返されることになります。

source: So if you have applications using Quarkus 1.x, please give a try to Quarkus 2.0 and report any issue you could experience on GitHub, be it in terms of bugs, broken compatibility or usability. We are in this together to build the best Quarkus release ever.
ja_jp: Quarkus 1.xを使ったアプリケーションをお持ちの場合は、ぜひQuarkus 2.0を試してみてください。また、バグや互換性の低下、使い勝手など、何か問題があればGitHubに報告してください。私たちは、これまでで最高のQuarkusリリースを作るために一緒に取り組んでいます。

source: So in this case we will automatically generate the marshaller and schemas for the included classes and place them in the schema package automatically. The package does not have to be provided, but if you use Infinispan query capabilities, you must know the generated package.
ja_jp: そこで今回は、含まれるクラスのマーシャラとスキーマを自動生成して、スキーマパッケージに自動で配置します。パッケージは用意する必要はありませんが、Infinispanクエリ機能を利用する場合は生成されたパッケージを知っておく必要があります。

source: So in this case we will automatically generate the marshaller and schemas for the included classes and place them in the schema package automatically. The package does not have to be provided, but if you use Infinispan search capabilities, you must know the generated package.
ja_jp: そこで今回は、含まれるクラスのマーシャラーとスキーマを自動生成して、スキーマパッケージに自動で配置します。パッケージは用意する必要はありませんが、Infinispan検索機能を利用する場合は生成されたパッケージを知っておく必要があります。

source: So instead of starting your application with:
ja_jp: アプリケーションを以下で起動するのではなく、

source: So join us as we explore how Quarkus helps Java developers everywhere to be more productive, create modern masterpieces and, well, have more fun: 90 odd minutes of technical discussion, some live coding and a Q&A - it’s going to be a blast.
ja_jp: Quarkus がどのようにして世界中の Java 開発者の生産性を向上させ、現代の傑作を生み出し、そしてより楽しくするのか、私たちと一緒に探求しましょう。90 分ほどの技術的な議論、ライブコーディング、そして Q&A は、きっと素晴らしいものになるでしょう。

source: So less than a year ago we decided to launch a Quarkus POC on _ocpdeploy_, the goal being to deploy it as a GraalVM executable. The main challenges we ran into were related to the lack of support for GraalVM in some of the libraries we were using: FreeMarker, https://github.com/hierynomus/smbj[SMBJ] (a java client library that implements the Server Message Block SMB2 and SMB3 protocols), the Fabric8 OpenShift client (when instantiating OpenShift specific CRDs), and a home made java agent that ships logs to a proprietary centralized logging system.
ja_jp: 1年前、私たちは _Ocpdeploy_でQuarkusのPOCを開始することにしました。その目的は、QuarkusをGraalVMの実行可能ファイルとしてデプロイすることでした。遭遇した主な課題は、使用していたいくつかのライブラリでGraalVMがサポートされていないことに関連していました。FreeMarker、 link:https://github.com/hierynomus/smbj[SMBJ]（Server Message Block SMB2およびSMB3プロトコルを実装したJavaクライアントライブラリ）、Fabric8 OpenShiftクライアント（OpenShift固有のCRDをインスタンス化する際）、そして独自の集中型ログシステムにログを送信する自作のJavaエージェントです。

source: So lets configure Quarkus to request that the access tokens must be verified by using them to acquire `UserInfo`:
ja_jp: ここで、アクセストークンを使用して `UserInfo` を取得することでアクセストークンの検証行うことをリクエストするように、Quarkus を設定してみましょう。

source: So now if we want to check if we need to fetch a new version, we can make the following request:
ja_jp: これで、新しいバージョンを取得する必要があるかどうかを確認したい場合は、次のようなリクエストを行うことができます:

source: So now let's actually secure something. Take a look at the new endpoint method `helloRolesAllowed` in the following:
ja_jp: では実際に何かをセキュア化してみましょう。下記の新しいエンドポイントメソッド `helloRolesAllowed` を見てみましょう:

source: So now what? Back to `<insert your favorite framework here>`? Not so fast...
ja_jp: さて、どうしましょう？ `<ココに好きなフレームワークを入れてください>` に戻る？そうはいきません...。

source: So read on to discover more and find out how you can make your extension available to all Quarkus developers today!
ja_jp: 詳細をお読みになり、すべてのQuarkus開発者が今すぐエクステンションを利用できるようにする方法をご覧ください。

source: So that you can exchange the message objects as follows:
ja_jp: 次のようにメッセージオブジェクトを交換できるようになります。

source: So the code snippet above can be rewritten as:
ja_jp: したがって、上記のコードスニペットは次のように書き直すことができます。

source: So the corresponding template does not result in a validation error even though the `Globals#user()` method returns `java.lang.String` which does not have the `name` property:
ja_jp: そのため、`Globals#user()` メソッドが `java.lang.String` を返し、それが `name` プロパティーを持たないにもかかわらず、対応するテンプレートはバリデーションエラーにはなりません。

source: So the workflow is simple:
ja_jp: なので、ワークフローはシンプルです。

source: So to handle these case, we can disable the auto-commit and switch to manual commit. In this case, it's the application's responsibility to commit the offsets regularly. So, the application needs to track the polled records, their processing, failures, and periodically commits the offsets. It might not look too tricky, but actually, it can become quite challenging. Again, in asynchronous scenarios, you may complete the processing of messages in various orders. For example, if you call a remote service for each record, the responses may not come in the same orders as the records. You need to track messages individually and only commit the offsets if all the previous messages are processed successfully. Without this, you may commit offsets while there is processing from previous records still in progress or even failed processing.
ja_jp: そこで、これらのケースを処理するために、自動コミットを無効にして手動コミットに切り替えることができます。この場合、定期的にオフセットをコミットするのはアプリケーションの責任です。したがって、アプリケーションはポーリングされたレコード、その処理、失敗を追跡し、定期的にオフセットをコミットする必要があります。これはそれほどトリッキーには見えないかもしれませんが、実際には非常に困難になることがあります。繰り返しになりますが、非同期のシナリオでは、様々な順序でメッセージの処理を完了させることができます。例えば、各レコードに対してリモートサービスを呼び出した場合、レスポンスはレコードと同じ順番で来るとは限りません。メッセージを個別に追跡し、前のすべてのメッセージが正常に処理された場合にのみオフセットをコミットする必要があります。これがないと、前のレコードからの処理がまだ進行中であったり、処理に失敗した場合にオフセットをコミットすることになるかもしれません。

source: So use SockJS, you need to configure the bridge, especially the addresses that will be used to communicate:
ja_jp: SockJSを使用するためには、ブリッジの設定、特に通信に使用されるアドレスの設定が必要です。

source: So we went from 46 M to 15 M; this is a considerable gain, even if it still does not fit on a floppy disk.
ja_jp: 46Mから15Mになりました。これは、フロッピーディスクに収まらないとはいえ、かなりの収穫です。

source: So what else have we got in MicroProfile Fault Tolerance? Let's look into timeouts.
ja_jp: では、MicroProfile Fault Toleranceには他に何があるのでしょうか。タイムアウトについて見てみましょう。

source: So what exactly does the `QuarkusComponentTest` do? It starts the CDI container and registers a dedicated xref:config-reference.adoc[configuration object].
ja_jp: では、 `QuarkusComponentTest` は実際には何を実行するのでしょうか。 これは、CDI コンテナーを起動し、専用の xref:config-reference.adoc[設定オブジェクト] を登録します。

source: So when using RESTEasy Classic even when you return a reactive type like `Uni` or `Multi` the initial request is still being handled on a worker thread and while the call to the library may result in non-blocking IO, nevertheless there is no way for RESTEasy Classic to reuse the worker thread once it is blocked waiting on IO.
ja_jp: そのため、RESTEasy Classic を使用する場合、 `Uni` や `Multi` のようなリアクティブ型を返しても、最初のリクエストはワーカースレッドで処理され、ライブラリーの呼び出しはノンブロッキング IO になることがあります。それでも IO の待機中にブロックされると、RESTEasyClassic がワーカースレッドを再利用する方法はありません。

source: So when you access the `/q/health/ready` endpoint of your application you will have information about the cluster status. It uses the cluster health endpoint, the check will be down if the status of the cluster is **red**, or the cluster is not available.
ja_jp: そのため、アプリケーションの `/q/health/ready` エンドポイントにアクセスすると、クラスターの状態に関する情報を得ることができます。これはクラスターヘルスエンドポイントを使用しており、クラスターの状態が **赤** であったり、クラスターが利用できなかったりするとチェックが失敗します。

source: So when you access the `/q/health/ready` endpoint of your application you will have information about the connection validation status.
ja_jp: そのため、アプリケーションの `/q/health/ready` エンドポイントにアクセスすると、接続の検証状況に関する情報が表示されます。

source: So when you access the `/q/health/ready` endpoint of your application, you will have information about the cluster status. It uses the cluster health endpoint, the check will be down if the status of the cluster is **red**, or the cluster is not available.
ja_jp: そのため、アプリケーションの `/q/health/ready` エンドポイントにアクセスすると、クラスタのステータスに関する情報を得ることができます。これはクラスタヘルスエンドポイントを使用しており、クラスタのステータスが *red* の場合、またはクラスタが利用できない場合、チェックはダウンします。

source: So when you access the `/q/health` endpoint of your application you will have information about the state of the Kafka Streams and the available and/or missing topics.
ja_jp: そのため、アプリケーションの `/q/health` エンドポイントにアクセスすると、Kafka Streams の状態や、利用可能なトピックや不足しているトピックについての情報を得ることができます。

source: So when you access the `/q/metrics` endpoint of your application you will have information about the connection pool status.
ja_jp: そのため、アプリケーションの `/q/metrics` エンドポイントにアクセスすると、接続プールのステータスに関する情報が得られます。

source: So when you access the `/q/metrics` endpoint of your application you will have information about the connection pool status. When using xref:smallrye-metrics.adoc[SmallRye Metrics], connection pool metrics will be available under the `vendor` scope.
ja_jp: そのため、アプリケーションの `/q/metrics` エンドポイントにアクセスすると、接続プールの状況に関する情報が表示されます。link:smallrye-metrics.html[SmallRye Metrics]を使用すると、接続プールのメトリクスは `vendor` スコープの配下で利用可能になっています。

source: So you can always start with that :)
ja_jp: だから、いつでもそれから始めることができます :)

source: So, for the `defaultChain` function, the Cloud Event type that triggers the function is `defaultChain`. It generates a response that triggers a new Cloud Event whose type is `defaultChain.output` and the event source is `defaultChain`.
ja_jp: したがって、 `defaultChain` 関数の場合、この関数をトリガーする Cloud Event のタイプは `defaultChain` です。これは、タイプが `defaultChain.output` でイベントソースが `defaultChain` である新しい Cloud Event をトリガーするレスポンスを生成します。

source: So, from now on, define the version in your projects. The latest version is 3.22.0.
ja_jp: そこで、今後は、プロジェクトでバージョンを定義するようにしてください。最新バージョンは3.22.0です。

source: So, if in another terminal, you run:
ja_jp: つまり、別の端末で、次を実行すると

source: So, if look at all the functions defined within `SimpleFunctionChain` you'll notice that one function triggers the next. The last function that is triggered is `lastChainLink`.
ja_jp: つまり、 `SimpleFunctionChain` 内で定義されているすべての関数を見てみると、ある関数が次の関数を引き金にしていることに気づくでしょう。最後にトリガーされる関数は `lastChainLink` です。

source: So, if you can build and use native images, why not if you can? It can pose some interesting challenges when incorperating into your CI/CD process and testing but nothing that has been a big issue.
ja_jp: ネイティブイメージをビルドして使用できるのであれば、そうしない手はありません。CI/CDプロセスやテストに組み込む際に、いくつかの興味深い課題が発生する可能性がありますが、大きな問題にはなっていません。

source: So, if you look at all the functions defined within `SimpleFunctionChain` you'll notice that one function triggers the next. The last function that is triggered is `lastChainLink`.
ja_jp: つまり、 `SimpleFunctionChain` 内で定義されているすべての関数を見てみると、ある関数が次の関数を引き金にしていることに気づくでしょう。最後にトリガーされる関数は `lastChainLink` です。

source: So, if you open up the unit test code in link:{quickstarts-tree-url}/funqy-quickstarts/funqy-knative-events-quickstart/src/test/java/org/acme/funqy/FunqyTest.java[FunqyTest.java] you'll see that its simply using RestAssured to make HTTP invocations to test the functions.
ja_jp: link:{quickstarts-tree-url}/funqy-quickstarts/funqy-knative-events-quickstart/src/test/java/org/acme/funqy/FunqyTest.java[FunqyTest.java] のユニットテストコードを開くと、単純にRestAssuredを使ってHTTP呼び出しをして関数をテストしていることがわかります。

source: So, if you open up the unit test code in {quickstarts-tree-url}/funqy-quickstarts/funqy-knative-events-quickstart/src/test/java/org/acme/funqy/FunqyTest.java[FunqyTest.java] you'll see that its simply using RestAssured to make HTTP invocations to test the functions.
ja_jp: そのため、 {quickstarts-tree-url}/funqy-quickstarts/funqy-knative-events-quickstart/src/test/java/org/acme/funqy/FunqyTest.java[FunqyTest.java] のユニットテストコードを開くと、関数をテストするためのHTTP呼び出しを行うために、単にRestAssuredを使用していることがわかります。

source: So, is there anything wrong with this? Looks wonderful... until you add a pinch of asynchrony.
ja_jp: それで、これに何か問題があるの?見た目は素晴らしい...非同期のピンチを追加するまでは。

source: So, it takes 21 MB of https://en.wikipedia.org/wiki/Resident_set_size[RSS], basically the amount of RAM it uses.
ja_jp: そのため、基本的には使用するRAMの量である link:https://en.wikipedia.org/wiki/Resident_set_size[RSS]を21MB使用します。

source: So, it’s not surprising to see Java client and server implementations for the emerging AI protocols, such as:
ja_jp: したがって、次のような新しいAIプロトコル向けのJavaクライアントおよびサーバーの実装が見られることは驚くべきことではありません。

source: So, let's deploy our application into a newly created project `my-project` in OpenShift:
ja_jp: それでは、OpenShiftで新たに作成したプロジェクト `my-project` にアプリケーションをデプロイしてみましょう。

source: So, the rest of our application can simply use the `sendMovieToKafka` method to send a movie to our Kafka topic.
ja_jp: そのため、残りのアプリケーションは `sendMovieToKafka` メソッドを使って、Kafka トピックにムービーを送信するだけです。

source: So, the rest of our application can use the `send` method to send a movie to our AMQP destination.
ja_jp: そこで、私たちのアプリケーションの残りの部分は、 `send` メソッドを使用して、AMQP の宛先にムービーを送信することができます。

source: So, to recap: registration sends a generated public key instead of a password, and login sends a signature for that public key, allowing you to verify that the user is who they were when they registered.
ja_jp: つまり、まとめると、登録時にはパスワードの代わりに生成した公開鍵を送信し、ログイン時にはその公開鍵に対する署名を送信することで、ユーザーが登録時の人物であることを確認することができるのです。

source: So, unlike the imperative model, where I/O blocks the execution, reactive switches to a continuation-based design, where the I/O threads are released, and continuation invoked when the I/Os complete. As a result, the I/O thread can handle multiple concurrent requests, improving the overall concurrency of the application.
ja_jp: そのため、I/Oが実行をブロックするような命令型モデルとは異なり、リアクティブ型ではI/Oスレッドを解放し、I/Oが完了した時点で継続を呼び出す継続型のデザインに切り替わります。その結果、I/Oスレッドは複数の同時リクエストを処理できるようになり、アプリケーション全体の同時性が向上します。

source: So, we can write records into Kafka containing our `Movie` data. That data is serialized using Avro. Now, it's time to implement a consumer for them.
ja_jp: `Movie` データを含むレコードを Kafka に書き込むことができます。そのデータは Avro を使用してシリアライズされます。では、それらのコンシューマーを実装してみましょう。

source: So, we can write records into Kafka containing our `Movie` data. That data is serialized using JSON Schema. Now, it's time to implement a consumer for them.
ja_jp: `Movie` データを含むレコードを Kafka に書き込むことができます。 そのデータは JSON スキーマを使用してシリアライズされます。 では、それらのコンシューマーを実装してみましょう。

source: So, what the message above is telling us is that our application caches a value that is supposed to be random as a constant. This is not desirable because something that's supposed to be random is no longer so, because the seed is baked in the image. The message above makes it quite clear what is causing this, but in other situations the cause might be more obfuscated. As a next step, we'll add some extra flags to the native executable generation to get more information.
ja_jp: したがって、上記のメッセージが示しているのは、アプリケーションが定数としてランダムであると想定される値をキャッシュしているということです。シードがイメージでベイク処理されているため、ランダムであるはずの何かがもはやランダムではないため、これは望ましくありません。上記のメッセージは、何が原因かを非常に明確に示していますが、他の状況では、原因はさらにわかりにくいかもしれません。次のステップとして、ネイティブ実行可能ファイルの生成にいくつかのフラグを追加して、より多くの情報を取得することにします。

source: So, what's Cloud Event? Cloud Event proposes a common way to describe events. The goal is, obviously, interoperability and easing the integration burden. Cloud Event 1.0 was released almost a year ago. Over the past year, many Cloud Providers adopted this format, such as Azure and Oracle. Several middlewares have also added support for Cloud Events, such as Knative, Kogito, Debezium, and Quarkus.
ja_jp: では、クラウドイベントとは何か?クラウドイベントは、イベントを記述するための共通の方法を提案しています。目的は明らかに相互運用性と統合負担の軽減です。クラウドイベント1.0はほぼ1年前にリリースされました。この1年で、AzureやOracleなど、多くのクラウドプロバイダーがこの形式を採用しました。また、Knative、Kogito、Debezium、Quarkusなど、いくつかのミドルウェアがクラウドイベントのサポートを追加しています。

source: So, when you register your user, you use your browser to enter your user information (username, your name, etc…) and instead of typing a password to identify yourself, you click a button which will invoke the WebAuthn browser API which will ask you to do something (press a button, use your fingerprint). Then, your browser will generate a proof of identity which you can send to your service instead of a password.
ja_jp: そこで、ユーザーを登録する際に、ブラウザーでユーザー情報 (ユーザー名、自分の名前など) を入力しパスワードを入力して 本人確認をする代わりに、ボタンをクリックすると、WebAuthn ブラウザー API が実行され、 何か (ボタンを押す、指紋を使うなど) をするように要求されます。すると、ブラウザーはパスワードの代わりに、サービスに送信できる ID 証明を生成します。

source: So, when you register, you send (mostly) a public key instead of a password, and the service stores that information as WebAuthn credentials for your new user account, and this is what will identify you later.
ja_jp: そのため、登録時にはパスワードの代わりに (主に) 公開鍵を送信し、サービスはその情報を新しいユーザーアカウントの WebAuthn 認証情報として保存し、これが後にあなたを識別することになります。
